nodes/bb219756.b9281/template

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
                                                                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                                                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                                                                  xmlns:ns1="http://rtu.ws.es.ormazabal.www/">
    <SOAP-ENV:Body>
        <ns1:GetStationInfo>
            <xmlwsinput>
                <commoninput>                                           

                                                               &lt;CommonInput reqId="M01" seqNum="7"

                                                                                              xmlns="http://com.ormazabal.es/requestRTU/CommonInput"

                                                                                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"

                                                                                              xsi:schemaLocation="http://com.ormazabal.es/requestRTU/CommonInput CommonInput.xsd " /&gt;

                                                               </commoninput>
            </xmlwsinput>
        </ns1:GetStationInfo>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>